selfservice/src/test/resources/lmng-queries/lmngServiceProvidersIdentityProvidersRevision3.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:adr="http://www.w3.org/2005/08/addressing"
               xmlns:sur="http://Surfmarket.CRMProxyService">
  <soap:Header>
    <adr:MessageID>urn:uuid:%UID%</adr:MessageID>
    <adr:ReplyTo>
      <adr:Address>http://www.w3.org/2005/08/addressing/anonymous</adr:Address>
    </adr:ReplyTo>
    <adr:To s:mustUnderstand="1" xmlns:s="s">https://crmproxy.surfmarket.nl/crmservice.svc</adr:To>
    <adr:Action>http://Surfmarket.CRMProxyService/ICrmService/GetData</adr:Action>
  </soap:Header>
  <soap:Body>
    <sur:GetData>
      <sur:InputXml>
        <fetch version="1.0" output-format="xml-platform" mapping="logical" distinct="true">
          <entity name="lmng_sdnarticle">
            <filter type="and">
              <condition attribute="lmng_sdnarticleid" operator="in">
                <value>%SERVICE_ID%</value>
                <value>%SERVICE_ID%</value>
              </condition>
            </filter>
            <link-entity name="lmng_sdnarticle_lmng_product" from="lmng_sdnarticleid" to="lmng_sdnarticleid"
                         visible="false" intersect="true">
              <link-entity name="lmng_product" from="lmng_productid" to="lmng_productid" alias="aa">
                <link-entity name="lmng_mediationagreement" from="lmng_mediationagreementid"
                             to="lmng_mediationagreementid" alias="ab">
                  <link-entity name="lmng_mediationagreement" from="lmng_mediationagreementid" to="lmng_source"
                               alias="ac">
                    <link-entity name="lmng_mediationagreement" from="lmng_mediationagreementid" to="lmng_source"
                                 alias="ad">
                      <link-entity name="lmng_licenseagreement" from="lmng_mediationagreementid"
                                   to="lmng_mediationagreementid" alias="license">
                        <attribute name="lmng_number"/>
                        <attribute name="lmng_validfrom"/>
                        <attribute name="lmng_validto"/>
                        <attribute name="lmng_organisationid"/>
                        <filter type="and">
                          <condition attribute="lmng_validfrom" operator="on-or-before" value="%VALID_ON%"/>
                          <condition attribute="lmng_validto" operator="on-or-after" value="%VALID_ON%"/>
                          <condition attribute="statuscode" operator="eq" value="4"/>
                          <condition attribute="lmng_organisationid" operator="eq" value="%INSTITUTION_ID%"/>
                          <condition attribute="lmng_organisationid" operator="eq" value="%INSTITUTION_ID%"/>
                        </filter>
                      </link-entity>
                    </link-entity>
                  </link-entity>
                </link-entity>
                <link-entity name="lmng_productvariation" from="lmng_productid" to="lmng_productid"
                             alias="productvariation">
                  <attribute name="lmng_licensemodel"/>
                  <attribute name="lmng_productid"/>
                </link-entity>
              </link-entity>
            </link-entity>
          </entity>
        </fetch>
      </sur:InputXml>
    </sur:GetData>
  </soap:Body>
</soap:Envelope>
